{
    "CharImage": "./imagenes_personaje/image_26.png",
    "CharPortrait": "./img/klukai_portrait.webp",
    "Name": "Klukai",
    "Class": "Sentinel",
    "ClassImage": "./imagenes_personaje/image_27.png",
    "Attributes": {
        "HP": 2226.0,
        "ATK": 1031.0,
        "DEF": 592.0,
        "StabilityGauge": "10 points",
        "MovementSpeed": "6 tiles"
    },
    "SkillAttribute": {
        "SAtt1": "Medium Type Bullet",
        "SAtt2": "Corrosion"
    },
    "Weakness": {
        "Weakness1": "Shotgun",
        "Weakness2": "Electric"
    },
    "Effects": {
        "Full": "Corrosive Infusion: At the end of the action, the caster deals AoE Corrosion damage equivalent to 12% ATK to the holder. For each additional stack, increases damage percentage by 12%. When the holder receives Corrosion damage from Klukai's active attacks or other enemies, the number of stacks increases by 1, and the duration is refreshed. This effect can be stacked up to 10 times, and is removed when the caster is killed. This is considered as a Corrosion debuff, and cannot be dispelled\n\nToxic Infiltration: At the end of the action, the holder gains 1 stack of Corrosive Infusion for 2 turns. Upon death, the caster applies Toxic Infiltration to the holder and all enemies within a 3 tile radius of the holder for 2 turns, and deals AoE Corrosion damage equivalent to 60% ATK. This effect is removed when the holder is killed, and is considered as a Corrosion debuff\n\nExtra Movement: Can move once, but is unable to execute any commands\n\nControl Type: Includes Taunt, Panic, Induce, and Stun\n\nTaunt: Unable to be controlled. Forced to use normal attack against the unit that applied this effect. Effect is dispelled when the unit that applied this effect dies\n\nPanic: Unable to be controlled. Automatically moves away from the unit that applied this effect. This effect is removed when the unit that applied this effect dies\n\nInduce: Unable to be controlled. Forced to move towards the unit that applied this effect. Effect is dispelled when the unit that applied this effect dies\n\nStun: Unable to take action\n\nCompetitiveness: Increases Corrosion damage dealt by 5%. This can be stacked up to 8 times, is considered as a buff and cannot be dispelled\n\nDEF Decrease II: Decreases DEF by 30%. This is considered as a Defense type debuff\n\nFear: Decreases movement speed by 1 tile, ATK by 30%, and Stability damage dealt by 4 points. This is considered as a debuff"
    },
    "Basic": [
        {
            "SkillName": "Swift Strike\n\n(Basic Attack / Single Target)",
            "SkillImage": "./imagenes_personaje/image_32.png",
            "Att1": "Stability Damage: 3",
            "Att2": "Cooldown: 0 turns",
            "Att3": "Contamination Gauge Consumption: 0",
            "SkillTypeBulletImage": "./imagenes_personaje/image_28.png",
            "SkillTypeBullet": "Medium Type Bullet",
            "Description": "Selects an enemy target within a 8 tile radius and deals Physical damage equivalent to 80% ATK to it",
            "Range": 8.0,
            "RangeImage": "./imagenes_personaje/image_37.png",
            "Effect": "Target"
        }
    ],
    "Skill": [
        {
            "SkillName": "Precise Detonation\n\n(Skill / AoE / Debuff)",
            "SkillImage": "./imagenes_personaje/image_38.png",
            "Att1": "Stability Damage: 3",
            "Att2": "Cooldown: 0 turns",
            "Att3": "Contamination Gauge Consumption: 3",
            "SkillTypeBulletImage": "./imagenes_personaje/image_28.png",
            "SkillExtraTypeBulletImage": "./imagenes_personaje/image_30.png",
            "SkillTypeBullet": "Medium Type Bullet",
            "SkillExtraTypeBullet": "Corrosion",
            "Description": "Selects an enemy target within a 8 tile radius and deals Corrosion damage equivalent to 80% ATK to it. Then, deals AoE Corrosion damage equivalent to 60% ATK to the target and all enemies within a 3 tile radius of it, and and pulls them towards the center by 1 tile\n\nIf this skill successfully kills a target, reduces the cooldown of Devastating Drift by 1 turn, and increases Contamination Gauge by 2 points\n\nIf no targets are killed, applies 1 stack of Corrosive Infusion for 2 turns",
            "Range": 8.0,
            "RangeImage": "./imagenes_personaje/image_41.png",
            "Effect": "Target",
            "Vertebrae 4": "Increases damage dealt by the first damage instance to 100% ATK. For each stack of Corrosive Infusion on the target, increases damage percentage of the additional attack by 5%. If this skill counters the enemy's weakness, it will ignore 15% of the damage reduction provided by Cover"
        }
    ],
    "Skill2": [
        {
            "SkillName": "Overpowering Corrosion\n\n(Skill / AoE / Debuff)",
            "SkillImage": "./imagenes_personaje/image_45.png",
            "Att1": "Stability Damage: 1",
            "Att2": "Cooldown: 0 turns",
            "Att3": "Contamination Gauge Consumption: 3",
            "SkillTypeBulletImage": "./imagenes_personaje/image_28.png",
            "SkillTypeBullet": "Corrosion",
            "Description": "Selects a tile within a 8 tile radius, and deals AoE Corrosion damage equivalent to 90% ATK to all enemies within a 3 tile radius of the specified tile, and applies Toxic Infiltration for 2 turns. Increases damage dealt by 15% if the enemy already has Toxic Infiltration",
            "Range": 8.0,
            "RangeImage": "./imagenes_personaje/image_47.png",
            "Effect": "Target",
            "Vertebrae 1": "Increases damage dealt by 15% → 30% if the enemy already has Toxic Infiltration\n\nThe effects of Toxic Infiltration triggered upon death can now be triggered even if the target hasn't been killed\n\nNew effect is added for Toxic Infiltration - at the end of the action, the caster applies Toxic Infiltration to all enemies without Toxic Infiltration within a 3 tile radius of the holder for 2 turns",
            "Vertebrae 5": "Increases effective range by 2 tiles, and increases damage dealt to 110% ATK. Increases the spread radius of Toxic Infiltration by 1 tile, and increases damage dealt to 80% ATK. If the target has Corrosion type debuffs, applies Toxic Infiltration before attacking for 2 turns\n\nNew effect is added for Toxic Infiltration - Increases damage taken by 30% when receiving damage from Klukai's active attacks"
        }
    ],
    "Ultimate": [
        {
            "SkillName": "Devastating Drift\n\n(Ultimate / AoE)",
            "SkillImage": "./imagenes_personaje/image_52.png",
            "Att1": "Stability Damage: 0",
            "Att2": "Cooldown: 6 turns",
            "Att3": "Contamination Gauge Consumption: 0",
            "SkillTypeBulletImage": "./imagenes_personaje/image_46.png",
            "SkillTypeBullet": "Corrosion",
            "Description": "Selects a tile within a 4 to 8 tile cross shaped radius, and lands on the specified tile. Deals AoE Corrosion damage equivalent to 100% ATK to all enemies within a 5 tile width of the path, and gains 6 tiles of Extra Movement. If this skill kills 2 or more target, this skill can be immediately used again. This effect can be triggered only once",
            "Range": "--",
            "RangeImage": "./imagenes_personaje/image_54.png",
            "Effect": "Target",
            "Vertebrae 3": "For each target hit, increases damage dealt by 10%, up to a maximum of 50%. If a boss target is hit, the damage increase is increased to 50% immediately. \n\nIf 2 or more targets or if a boss target is hit, this skill can be immediately used again. Applies DEF Decrease II and Toxic Infiltration on the target before attacking for 2 turns   ",
            "Vertebrae 6": "This skill ignores damage reduction from Cover\n\nIncreases width by 2 tiles and applies Fear for 2 turns\n\nAfter skill usage, triggers the effect of Corrosive Infusion and the effects of Toxic Infiltration that are triggered upon death for all enemies",
            "Fixed Key 2": "Devastating Drift: If this skill only hits 1 target, increases damage dealt by 30%",
            "Fixed Key 5": "Devastating Drift: Decreases width to 3 tiles. For each tile decreased, increases damage dealt by 10%"
        }
    ],
    "Passive": [
        {
            "SkillName": "Pride of the Elite",
            "SkillImage": "./imagenes_personaje/image_56.png",
            "Att1": "Stability Damage: 0",
            "Att2": "Cooldown: 0 turns",
            "Att3": "Contamination Gauge Consumption: 0",
            "Description": "Klukai is immune to all Control Type effects. Applies 1 stack of Corrosive Infusion for 2 turns to the target when dealing damage with active attacks, and gains 1 stack of Competitiveness after skill usage\n\nFor each instance of Corrosion damage dealt by Klukai's active attacks or other allies, increases Contamination Gauge by 1 point. For every 3 points of Contamination Gauge gained, decreases cooldown of Devastating Drift by 1 turn",
            "Range": "Self",
            "RangeImage": "./imagenes_personaje/image_57.png",
            "Effect": "Target",
            "Vertebrae 2": "At the start of the battle, Klukai gains 3 stacks of Competitiveness. When allies deal Corrosion damage, Klukai gains 1 stack of Competitiveness. Increases the maximum stacks of Competitiveness by 4. \n\nFor every 3 points of Contamination Gauge gained, applies 1 stack of Corrosive Infusion and reduces the cooldown of Devastating Drift by an additional turn\n\nNew effect is added for Corrosive Infusion - when the holder receives Corrosion damage from Klukai's active attacks or other enemies, the number of stacks additionally increases by 1. Reduces DEF by 1%, and increases the maximum stacks by 5"
        }
    ],
    "Enhancements": [
        {
            "1": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 1",
                    "Level": 1.0,
                    "Effect": "ATK +39\nDEF +21",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "20\n\n\n1000"
                }
            ],
            "2": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 2",
                    "Level": 20.0,
                    "Effect": "HP +80\nATK +5.0%",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "20\n\n\n2000"
                }
            ],
            "3": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 3",
                    "Level": 25.0,
                    "Effect": "ATK +47\nDEF +29",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "40\n\n\n4000"
                }
            ],
            "4": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 4",
                    "Level": 30.0,
                    "Effect": "HP +110\nATK +5.0%",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "80\n\n\n8000"
                }
            ],
            "5": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 5",
                    "Level": 35.0,
                    "Effect": "ATK +55\nDEF +38",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "120\n\n\n10000"
                }
            ],
            "6": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Enhancement 6",
                    "Level": 40.0,
                    "Effect": "ATK +63\nHP +143",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "160\n\n\n12000"
                }
            ],
            "7": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 1",
                    "Level": 20.0,
                    "Effect": "At the start of the turn, if there is only 1 enemy on the field, applies 1 stack of Corrosive Infusion to it for 2 turns, and increases Contamination Gauge by 2 points",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "1\n\n\n3000"
                }
            ],
            "8": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 2",
                    "Level": 20.0,
                    "Effect": "Devastating Drift: If this skill only hits 1 target, increases damage dealt by 30%",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "1\n\n\n3000"
                }
            ],
            "9": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 3",
                    "Level": 30.0,
                    "Effect": "New effect is added for Corrosive Infusion - Increases damage dealt by 15% towards targets that have 0 Stability",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "1\n\n\n8000"
                }
            ],
            "10": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 4",
                    "Level": 30.0,
                    "Effect": "For each instance of support attack dealt by other allies, increases Contamination Gauge by 1 point",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "1\n\n\n8000"
                }
            ],
            "11": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 5",
                    "Level": 40.0,
                    "Effect": "Devastating Drift: Decreases width to 3 tiles. For each tile decreased, increases damage dealt by 10%",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "2\n\n\n12000"
                }
            ],
            "12": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Fixed Key 6",
                    "Level": 40.0,
                    "Effect": "If the holder did not die from Toxic Infiltration, the holder gains 1 stack of Corrosive Infusion for 2 turns",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "2\n\n\n12000"
                }
            ],
            "13": [
                {
                    "IconImage": null,
                    "Enhancement 1": "Common Key",
                    "Level": 40.0,
                    "Effect": "ATK +5.0% / At the start of the turn, if the holder is at maximum Contamination Gauge, increases AoE damage dealt by the next active attack by 10%",
                    "MaterialsImage1": null,
                    "MaterialsImage2": null,
                    "MaterialsQuantity": "None"
                }
            ]
        }
    ]
}